{
    "packaging" : [
        {
            "basic" : "To submit your iOS application to the Veracode Platform, Veracode requires that you package your application by archiving the generated .xcarchive folder in ZIP format. You must manually create the package because Xcode does not bundle the debug information automatically in a portable format.",
            "sca": [
                "Include Podfile.lock in your root of your ZIP archive for submission."
            ],
            "format" : [
                {
                    "type" : "IPA",
                    "structure": [],
                    "notes": [
                        {
                            "note": "See Packaging Guidance for respective Cross-Platform framework."
                        }
                    ]
                },
                {
                    "type" : "XCARCHIVE",
                    "structure": [],
                    "notes": [
                        {
                            "note": "GEN-IR requires an input (the build log) and an output (the path to place the bitcode). To make packaging easy, Veracode expects the bitcode to be placed in the XCARCHIVE in a folder called IR."
                        },
                        {
                            "note": "Run the tool with your build log and archive path: gen-ir build.log MyProject.xcarchive/IR"
                        },
                        {
                            "note": "Zip the XCARCHIVE file: zip -r MyProject.zip MyProject.xcarchive"
                        },
                        {
                            "note": "Alternatively, you can right click the xcarchive and choose Compress in Finder."
                        },
                        {
                            "note": "You can then upload the ZIP archive of your iOS application to the Veracode Platform for analysis."
                        }
                    ]
                }
            ],
            "special" : [
                {
                    "type": "",
                    "notes": [
                        {
                            "note": "Veracode provides a mobile application packager for Xcode that can help package iOS applications built with Xcode 11.x or later. Veracode recommends you use this tool to prepare your application for analysis on the Veracode Platform. View the instructions on installing and using the Veracode Mobile Application Packager."
                        }
                    ]
                }
            ]
        }
    ],
    "compilation" : [
        {
            "basic" : "Veracode requires that all components of iOS applications to support bitcode. Veracode offers an Open-Source CLI tool called gen-ir to assist in generating bitcode, including for Xcode 14 where the ENABLE_BITCODE setting was deprecated. This tool can be used from a CI/CD environment or the command line.",
            "code" : "xcodebuild clean && xcodebuild archive -project MyProject.xcodeproj -scheme MyScheme-Veracode -destination generic/platform=iOS DEBUG_INFORMATION_FORMAT=dwarf-with-dsym -archivePath MyProject.xcarchive ENABLE_BITCODE=NO > build.log",
            "code_flutter_ios" : "flutter build ipa --debug",
            "notes_flutter": "Veracode requires a debug build of your Flutter application. You can use the Flutter CLI tool to build your application:",
            "maui_basic": "You can use the .NET CLI to compile a your application by running the following command.",
            "maui_code": "dotnet build -c Debug",
            "notes" : ["Run 'xcodebuild clean' and then Archive a Debug Build for Xcode", "1. In the Xcode Toolbar, select your scheme, then select New Scheme…","2. Choose the target you’d like to build, and append -Veracode to the name (Do no accidently submit to App Store Connect).", "3. Select your new scheme, then select Edit Scheme…","4. Choose Archive", "5. Change Build Configuration to Debug. You can provide a custom archive name if you prefer.","6. Set build settings for the new scheme:","Debug Information Format = DWARF with dSYM File","7. Export a build log with Xcode or use the GEN-IR tool."]
       }
    ],
    "reference" : [
        {
            "type" : "links",
            "resource": [
                {
                    "name": "iOS Compilation/Packaging Guide",
                    "url": "https://docs.veracode.com/r/compilation_ios"
                },
                {
                    "name": "Veracode iOS GEN-IR Tool",
                    "url": "https://github.com/veracode/gen-ir"
                }
            ]
        },
        {
            "type" : "videos",
            "resource": [
                {
                    "name": "Start a Static Scan",
                    "url": "https://www.youtube.com/embed/M-v0dodSavM"
                }
            ]
        },
        {
            "type" : "examples",
            "resource": [
                {
                    "name": "N/A",
                    "url": "N/A"
                }
            ]
        }
    ]

}